{"pageProps":{"_nextI18Next":{"initialI18nStore":{"pt":{"common":{"close-modal":"Fechar modal","open-modal":"Abrir modal","present":"presente","article_one":"{{count}} artigo","article_other":"{{count}} artigos","cancel":"Cancelar","delete":"Apagar","no-posts-yet-title":"Ainda não há posts","no-posts-yet-description":"Volte em breve.","404-message":"404 - Página não encontrada"},"about":{"title":"Sobre mim","description-1":"Esse espaço é onde eu testo coisas novas que quero aprender, além de escrever sobre meus pensamentos e técnologia, principalmente sobre front-end.","description-2":"Já trabalhei com diversas ferramentas no mundo do front-end, do básico até os frameworks mais atuais de hoje em dia, como por exemplo: (clique na linguagem para abrir mais detalhes)","description-3":"Hoje estou trabalhando com design systems e micro frontends.","projects-title":"Projetos open source que trabalhei","experiences-title":"Minhas experiências passadas","boticario-description":"Faço parte do time de autoatendimento, onde cuido das aplicações front-end que contemplam autenticação, dados do usuário, como histórico dos pedidos, favoritos, cadastro, endereço, etc. Além de também cuidar da aplicação responsável pela FAQ.","olist-description":"Trabalhei no desenvolvimento do \"Olist Design System\" e quebrando o front-end da empresa em pequenas aplicações (microfrontend). (onde faz sentido)","gympass-description":"Desenvolvi a versão inicial do produto \"Gympass Wellness\", criei o design system multi plataforma Yoga, e trabalhei em diversos times diferentes.","catho-description":"Na Catho foi onde encontrei minha paixão pelo mundo do desenvolvimento front-end. Aqui trabalhei em diversos times, com diferentes projetos e pessoas. Desde projetos como integrações com Salesforce até quando a empresa decidiu migrar o front-end acoplado no PHP para SPAs em React. Também participei da construção da biblioteca de componentes chamada \"Quantum\"","encontra-description":"Uma pequena empresa onde tive contato com a base, HTML, CSS e JavaScript","quantum-description":"Uma biblioteca de componentes React criada em 2018 e em uso até hoje. Foi criada com o objetivo de ser uma biblioteca de componentes para ser usada em todos os produtos da Catho.","react95-description":"React95 é uma biblioteca de componentes com a cara do Windows95.","yoga-description":"O Design System multi plataforma (React & React Native) do Gympass. Com suporte para multiplos temas e com uma boa tokenização.","technologies":"Tecnologias utilizadas"},"sign-in-modal":{"title":"Escolha uma forma de login:","sign-in-with-google":"Entrar com o Google","sign-in-with-google-label":"Entre com sua conta do google","disclaimer-1":"Seu nome será utilizado para exibir seus comentários.","disclaimer-2":"Você pode apagar seus dados a qualquer momento."},"delete-account-modal":{"title":"Apagar minha conta","description":"Todos os seus comentários também serão excluídos.","button":"Apagar minha conta"},"sidebar":{"sign-in":"Entrar","sign-out":"Sair","delete-account":"Deletar conta","home":"Início","blog":"Blog","about":"Sobre","socials":"Redes sociais","change-theme":"Trocar tema","open-menu":"abrir menu","close-menu":"fechar menu","language":"Idioma"}}},"initialLocale":"pt","ns":["common","about","sign-in-modal","delete-account-modal","sidebar"],"userConfig":{"debug":false,"i18n":{"defaultLocale":"pt","locales":["en","pt"]},"reloadOnPrerender":false,"default":{"debug":false,"i18n":{"defaultLocale":"pt","locales":["en","pt"]},"reloadOnPrerender":false}}}},"__N_SSG":true}