{"pageProps":{"_nextI18Next":{"initialI18nStore":{"en":{"common":{"close-modal":"Close modal","open-modal":"Open modal","present":"present","article_one":"{{count}} article","article_other":"{{count}} articles","cancel":"Cancel","delete":"Delete","no-posts-yet-title":"No posts yet","no-posts-yet-description":"Come back soon.","404-message":"404 - Page Not Found","reading-time":"min read"},"about":{"title":"About me","description-1":"This space is where I test new things I want to learn and write about thoughts and technology in general but mainly about front-end stuff.","description-2":"I've worked with several front-end tools, from the basics to the most recent frameworks and libraries, such as: (click in the language to open)","projects-title":"Open source projects that I've worked on","experiences-title":"My previous experiences","brex-description":"Member of the front-end platform team, working mainly on the company's design system and internal developer tools.","boticario-description":"I was part of the self-service team, where I took care of front-end applications that include authentication, user data, such as order history, favorites, registration, address, etc. In addition to also taking care of the application responsible for the FAQ system.","olist-description":"Worked on developing the Olist Design System and splitting the company's front-end into small micro frontends applications. (where makes sense)","gympass-description":"I've developed the initial version of the Gympass Wellness product, created the multi-platform Yoga design system, and worked with a bunch of different teams.","catho-description":"In Catho was where I discovered my passion for the front-end development world. Here I was able to work in so many teams. With different projects and different people, from projects like Salesforce integration or the redesign of the recruiter area to when the company decided to migrate from the legacy PHP coupled applications to SPA's built with React. I've also participated in the company react component library creation called Quantum","encontra-description":"It was a small company where I started to get in touch with the base of HTML, CSS, and Javascript.","quantum-description":"A react component library that was created in 2018 and is still used nowadays","react95-description":"React95 is a component library inspired on the Windows 95 UI design.","yoga-description":"The Gympass multi-platform design-system (React & React-Native), with support for multiple themes and with a great tokenization.","technologies":"Technologies"},"sign-in-modal":{"title":"Choose a login method:","sign-in-with-google":"Sign in with Google","sign-in-with-google-label":"Sign in with your google account","disclaimer-1":"Your name will be used to display your comments","disclaimer-2":"You can delete your data at any time"},"delete-account-modal":{"title":"Delete my account","description":"All your comments will be deleted as well.","button":"Delete my account"},"sidebar":{"sign-in":"Login","sign-out":"Logout","delete-account":"Delete account","home":"Home","blog":"Blog","about":"About","socials":"Socials","change-theme":"Change theme","open-menu":"open menu","close-menu":"close menu","language":"Language"}},"pt":{"common":{"close-modal":"Fechar modal","open-modal":"Abrir modal","present":"presente","article_one":"{{count}} artigo","article_other":"{{count}} artigos","cancel":"Cancelar","delete":"Apagar","no-posts-yet-title":"Ainda não há posts","no-posts-yet-description":"Volte em breve.","404-message":"404 - Página não encontrada","reading-time":"minutos de leitura"},"about":{"title":"Sobre mim","description-1":"Esse espaço é onde eu testo coisas novas que quero aprender, além de escrever sobre meus pensamentos e tecnologia, principalmente sobre front-end.","description-2":"Já trabalhei com diversas ferramentas no mundo do front-end, do básico até os frameworks mais atuais de hoje em dia, como por exemplo: (clique na linguagem para abrir mais detalhes)","projects-title":"Projetos open source que trabalhei","experiences-title":"Minhas experiências passadas","brex-description":"Membro do time de plataforma front-end, trabalhando majoritariamente no design system da empresa e em ferramentas internas para desenvolvedores.","boticario-description":"Fiz parte do time de autoatendimento, onde cuidava das aplicações front-end que contemplam autenticação, dados do usuário, como histórico dos pedidos, favoritos, cadastro, endereço, etc. Além de também cuidar da aplicação responsável pela FAQ.","olist-description":"Trabalhei no desenvolvimento do \"Olist Design System\" e quebrando o front-end da empresa em pequenas aplicações (microfrontend). (onde faz sentido)","gympass-description":"Desenvolvi a versão inicial do produto \"Gympass Wellness\", criei o design system multi plataforma Yoga, e trabalhei em diversos times diferentes.","catho-description":"Na Catho foi onde encontrei minha paixão pelo mundo do desenvolvimento front-end. Aqui trabalhei em diversos times, com diferentes projetos e pessoas. Desde projetos como integrações com Salesforce até quando a empresa decidiu migrar o front-end acoplado no PHP para SPAs em React. Também participei da construção da biblioteca de componentes chamada \"Quantum\"","encontra-description":"Uma pequena empresa onde tive contato com a base, HTML, CSS e JavaScript","quantum-description":"Uma biblioteca de componentes React criada em 2018 e em uso até hoje. Foi criada com o objetivo de ser uma biblioteca de componentes para ser usada em todos os produtos da Catho.","react95-description":"React95 é uma biblioteca de componentes com a cara do Windows95.","yoga-description":"O Design System multi plataforma (React & React Native) do Gympass. Com suporte para multiplos temas e com uma boa tokenização.","technologies":"Tecnologias utilizadas"},"sign-in-modal":{"title":"Escolha uma forma de login:","sign-in-with-google":"Entrar com o Google","sign-in-with-google-label":"Entre com sua conta do google","disclaimer-1":"Seu nome será utilizado para exibir seus comentários.","disclaimer-2":"Você pode apagar seus dados a qualquer momento."},"delete-account-modal":{"title":"Apagar minha conta","description":"Todos os seus comentários também serão excluídos.","button":"Apagar minha conta"},"sidebar":{"sign-in":"Entrar","sign-out":"Sair","delete-account":"Deletar conta","home":"Início","blog":"Blog","about":"Sobre","socials":"Redes sociais","change-theme":"Trocar tema","open-menu":"abrir menu","close-menu":"fechar menu","language":"Idioma"}}},"initialLocale":"en","ns":["common","about","sign-in-modal","delete-account-modal","sidebar"],"userConfig":{"debug":false,"i18n":{"defaultLocale":"pt","locales":["en","pt"]},"reloadOnPrerender":false,"default":{"debug":false,"i18n":{"defaultLocale":"pt","locales":["en","pt"]},"reloadOnPrerender":false}}}},"__N_SSG":true}